; domain
(define (domain blocksworld)
  (:requirements :strips :typing)
  (:types block)
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))

  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x - block ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y))))

)

; problem
(define (problem problem_4_682)
(:domain blocksworld)
(:objects b1 b2 b3 b4)
(:init 
(handempty)
(on b1 b4)
(on b2 b1)
(on b3 b2)
(clear b3)
(ontable b4)
)
(:goal
(and
(ontable b1)
(on b2 b1)
(clear b2)
(ontable b3)
(clear b3)
(ontable b4)
(clear b4)

)

)
)

; plan
1. (unstack b3 b2)
   deleted: (clear b3) (handempty) (on b3 b2)
   added: (holding b3) (clear b2)
   goals met: 3 of 7
2. (put-down b3)
   deleted: (holding b3)
   added: (clear b3) (handempty) (ontable b3)
   goals met: 5 of 7
3. (unstack b2 b1)
   deleted: (clear b2) (handempty) (on b2 b1)
   added: (holding b2) (clear b1)
   goals met: 3 of 7
4. (put-down b2)
   deleted: (holding b2)
   added: (clear b2) (handempty) (ontable b2)
   goals met: 4 of 7
5. (unstack b1 b4)
   deleted: (clear b1) (handempty) (on b1 b4)
   added: (holding b1) (clear b4)
   goals met: 5 of 7
6. (put-down b1)
   deleted: (holding b1)
   added: (clear b1) (handempty) (ontable b1)
   goals met: 6 of 7
7. (pick-up b2)
   deleted: (ontable b2) (clear b2) (handempty)
   added: (holding b2)
   goals met: 5 of 7
8. (stack b2 b1)
   deleted: (holding b2) (clear b1)
   added: (clear b2) (handempty) (on b2 b1)
   goals met: 7 of 7
